In [36]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [16]:
df = pd.read_csv(r"C:\Users\DELL\OneDrive\Desktop\Data Analyst - Intern\Day 07\online_market.csv")

In [22]:
df.head()

,transaction_id,order_date,product_category,product_id,product_name,units_sold,unit_price,total_revenue,region,payment_method
0,10001,10/8/2024,Home Appliances,179,Dyson V11 Vacuum,4,213.35,853.40,Europe,Debit Card
1,10002,3/20/2024,Books,105,Harry Potter,4,25.13,100.52,Europe,Debit Card
2,10003,7/29/2024,Books,153,Atomic Habits,5,774.46,3872.30,Asia,Debit Card
3,10004,12/24/2024,Books,120,Harry Potter,1,40.47,40.47,Europe,Credit Card
4,10005,3/31/2024,Clothing,187,Nike Air Max,4,2459.19,9836.76,Europe,Credit Card

In [17]:
print("Initial Shape:", df.shape)
print("Column Types:\n", df.dtypes)
print("Missing Values:\n", df.isnull().sum())

Initial Shape: (1000, 10)
Column Types:
 transaction_id        int64
order_date           object
product_category     object
product_id            int64
 product_name        object
units_sold            int64
unit_price          float64
total_revenue       float64
region               object
payment_method       object
dtype: object
Missing Values:
 transaction_id      0
order_date          0
product_category    0
product_id          0
 product_name       0
units_sold          0
unit_price          0
total_revenue       0
region              0
payment_method      0
dtype: int64

In [19]:
df = df.drop_duplicates()

In [27]:
df.isnull()

,transaction_id,order_date,product_category,product_id,product_name,units_sold,unit_price,total_revenue,region,payment_method
0,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...
995,False,False,False,False,False,False,False,False,False,False
996,False,False,False,False,False,False,False,False,False,False
997,False,False,False,False,False,False,False,False,False,False
998,False,False,False,False,False,False,False,False,False,False
999,False,False,False,False,False,False,False,False,False,False

In [24]:
df = df.drop_duplicates()

In [ ]:
# Ensure correct type
df["total_revenue"] = pd.to_numeric(df["total_revenue"], errors="coerce")

In [29]:
total_revenue = df["total_revenue"].sum()
print("Total Revenue:", round (total_revenue, 2))

Total Revenue: 3652901.48

In [26]:
total_units = df["units_sold"].sum()
print("Total Units Sold:", total_units)

Total Units Sold: 3001

In [28]:
avg_price = df["unit_price"].mean()
print("Average Unit Price:", round(avg_price, 2))

Average Unit Price: 1226.41

In [30]:
avg_order_revenue = df["total_revenue"].mean()
print("Average Order Revenue:", round(avg_order_revenue, 2))

Average Order Revenue: 3652.9

In [46]:
print(df.columns)

Index(['transaction_id', 'order_date', 'product_category', 'product_id',
       ' product_name', 'units_sold', 'unit_price', 'total_revenue', 'region ',
       'payment_method'],
      dtype='object')

In [52]:
# Strip spaces from column headers
df.columns = df.columns.str.strip()

In [53]:
revenue_by_region = df.groupby("region")["total_revenue"].sum()
print("\nRevenue by Region:\n", revenue_by_region)

Revenue by Region:
 region
Asia             1322199.96
Europe           1187035.08
North America    1143666.44
Name: total_revenue, dtype: float64

In [54]:
revenue_by_category = df.groupby("product_category")["total_revenue"].sum()
print("Revenue by Category:", revenue_by_category)

Revenue by Category: product_category
Beauty Products    697149.92
Books              549623.64
Clothing           617992.15
Electronics        607751.00
Home Appliances    565481.77
Sports             614903.00
Name: total_revenue, dtype: float64

In [55]:
top_products = df.groupby("product_name")["total_revenue"].sum().sort_values(ascending=False).head(5)
print("\nTop 5 Products by Revenue:\n", top_products)

Top 5 Products by Revenue:
 product_name
Neutrogena Skincare Set        261892.90
Levi's 501 Jeans               249473.62
Dove Soap Pack                 237087.81
Wilson Evolution Basketball    219294.01
Dyson V11 Vacuum               216677.80
Name: total_revenue, dtype: float64

In [57]:
# Make sure order_date is datetime
df["order_date"] = pd.to_datetime(df["order_date"], errors="coerce")

In [60]:
# Group by month from order_date
monthly_revenue = df.groupby(df["order_date"].dt.to_period("M"))["total_revenue"].sum()
print("\nMonthly Revenue Trend:\n", monthly_revenue)

Monthly Revenue Trend:
 order_date
2024-01    277490.85
2024-02    248909.15
2024-03    337418.96
2024-04    300685.34
2024-05    334803.06
2024-06    313091.44
2024-07    309116.77
2024-08    236960.87
2024-09    339793.18
2024-10    289149.31
2024-11    307300.39
2024-12    358182.16
Freq: M, Name: total_revenue, dtype: float64

Monthly Revenue Trend:
 order_date
2024-01    277490.85
2024-02    248909.15
2024-03    337418.96
2024-04    300685.34
2024-05    334803.06
2024-06    313091.44
2024-07    309116.77
2024-08    236960.87
2024-09    339793.18
2024-10    289149.31
2024-11    307300.39
2024-12    358182.16
Freq: M, Name: total_revenue, dtype: float64